app/controllers/todo_controller.rb

  def index
    @projects = Project.includes(:todos)
---
SELECT "projects".* FROM "projects"
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" IN ($1, $2, $3)  [["project_id", 1], ["project_id", 2], ["project_id", 3]]

  def update
    @todo = Todo.find(params[:id])
    if @todo.isCompleted
      @todo.isCompleted = false
    else
      @todo.isCompleted = true
    end
    @todo.save
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "todos" SET "isCompleted" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["isCompleted", true], ["updated_at", "2019-10-19 11:39:11.668687"], ["id", 2]]

  def create
    @todo = Todo.new(todo_params)
    @todo.save
---
INSERT INTO "todos" ("text", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "New"], ["project_id", 1], ["created_at", "2019-10-16 12:32:52.988810"], ["updated_at", "2019-10-16 12:32:52.988810"]]