app/views/todo/index.html.erb

SELECT "todos".* FROM "todos" WHERE (project_id = 1)
---
<ul>
  <% for @td in Todo.where('project_id = ?', @proj.id) %>

SELECT "projects".* FROM "projects"
---
    <%= new_form.text_field(:text) %><br>
    <%= new_form.collection_select(:project_id, Project.all, :id, :title, {}, {:onChange => "changeSelect();", :id => 'project_id'}) %>